Revit 2027 API
Mesh.GetNormals Method
 Returns all normals assigned to the mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetNormals()
Public Function GetNormals As IList(Of XYZ)
public:
IList<XYZ^>^ GetNormals()
member GetNormals : unit -> IList<XYZ>
Return Value
IList<XYZ>
 An array of XYZ values, each representing a normal unit vector.
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace